/*
#############################################################################################
# Special Force 2 (1.0.46397.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, crylessdomore
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Engine.Engine.ChangePostProcessChain
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execChangePostProcessChain_Parms
{
	unsigned long                                      bToLowLevel : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetEngine
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetEngine_Parms
{
	class UEngine*                                     ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.AddOverlayWrapped
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execAddOverlayWrapped_Parms
{
	class UFont*                                       Font;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Text;                                             		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              X;                                                		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleX;                                           		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleY;                                           		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              WrapWidth;                                        		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Engine.AddOverlay
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execAddOverlay_Parms
{
	class UFont*                                       Font;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Text;                                             		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              X;                                                		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleX;                                           		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleY;                                           		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bIsCentered : 1;                                  		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Engine.RemoveAllOverlays
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execRemoveAllOverlays_Parms
{
};

// Function Engine.Engine.StopMovie
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execStopMovie_Parms
{
	unsigned long                                      bDelayStopUntilGameHasRendered : 1;               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Engine.PlayLoadMapMovie
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execPlayLoadMapMovie_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetLastMovieName
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetLastMovieName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.Engine.GetAudioDevice
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetAudioDevice_Parms
{
	class UAudioDevice*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.IsSplitScreen
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsSplitScreen_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetAdditionalFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetAdditionalFont_Parms
{
	int                                                AdditionalFontIndex;                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFont*                                       ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetSubtitleFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetSubtitleFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetLargeFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetLargeFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetMediumFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetMediumFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetSmallFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetSmallFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetTinyFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetTinyFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.GetBuildDate
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetBuildDate_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.Engine.GetCurrentWorldInfo
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetCurrentWorldInfo_Parms
{
	class AWorldInfo*                                  ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.IsGame
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsGame_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Engine.IsEditor
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsEditor_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.GetDefaultOverlayColor
// [0x00820802] ( FUNC_Event )
struct UGameEngine_eventGetDefaultOverlayColor_Parms
{
	struct FLinearColor                                ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FLinearColor                             DefOverlayColor;                                  		// 0x0010 (0x0010) [0x0000000000000000]              
};

// Function Engine.GameEngine.ClearMITVForSFCubeMap
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execClearMITVForSFCubeMap_Parms
{
};

// Function Engine.GameEngine.ClearMICForSFCubeMap
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execClearMICForSFCubeMap_Parms
{
};

// Function Engine.GameEngine.AddMITVForSFCubeMap
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execAddMITVForSFCubeMap_Parms
{
	class UMITVforSFCubeMap*                           MITV;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.AddMICForSFCubeMap
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execAddMICForSFCubeMap_Parms
{
	class UMICforSFCubeMap*                            MIC;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.GetMessengerServerPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetMessengerServerPort_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.GetMessengerServerIP
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetMessengerServerIP_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.GetClanServerBaseURL
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetClanServerBaseURL_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.GetClanServerPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetClanServerPort_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.GetClanServerIP
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetClanServerIP_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.SetHostAddr
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execSetHostAddr_Parms
{
	struct FString                                     IP;                                               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                Port;                                             		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.SetRelayServer
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execSetRelayServer_Parms
{
	unsigned long                                      bUseRelay : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FString                                     IP;                                               		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                Port;                                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.SetRelayServerPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execSetRelayServerPort_Parms
{
	int                                                Port;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.GetRelayServerPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetRelayServerPort_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.SetRelayServerIP
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execSetRelayServerIP_Parms
{
	struct FString                                     IP;                                               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.GetRelayServerIP
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetRelayServerIP_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.UseRelayServer
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execUseRelayServer_Parms
{
	unsigned long                                      bUseRelay : 1;                                    		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.GameEngine.IsUsingRelayServer
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execIsUsingRelayServer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.GetGameServerPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetGameServerPort_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.GetGameServerIP
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetGameServerIP_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.GameEngine.SetHostPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execSetHostPort_Parms
{
	int                                                Port;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.GetHostPort
// [0x00022400] ( FUNC_Native )
struct UGameEngine_execGetHostPort_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.OnInitOnlineSubsystem
// [0x40020800] ( FUNC_Event )
struct UGameEngine_eventOnInitOnlineSubsystem_Parms
{
};

// Function Engine.GameEngine.FinishedPlayingOgg
// [0x00022800] ( FUNC_Event )
struct UGameEngine_eventFinishedPlayingOgg_Parms
{
};

// Function Engine.GameEngine.GetOnlineSubsystem
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execGetOnlineSubsystem_Parms
{
	class UOnlineSubsystem*                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.GameEngine.DestroyNamedNetDriver
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execDestroyNamedNetDriver_Parms
{
	struct FName                                       NetDriverName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.GameEngine.CreateNamedNetDriver
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execCreateNamedNetDriver_Parms
{
	struct FName                                       NetDriverName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetHealthPercentageINT
// [0x00020900] ( FUNC_Event )
struct AActor_eventGetHealthPercentageINT_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.KillCamRestore
// [0x00020900] ( FUNC_Event )
struct AActor_eventKillCamRestore_Parms
{
	class AActor*                                      OriginalActor;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.GetShouldSaveForCheckpointName
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetShouldSaveForCheckpointName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetApplyCheckpointRecordName
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetApplyCheckpointRecordName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetCreateCheckpointRecordName
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetCreateCheckpointRecordName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetCheckpointRecordName
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetCheckpointRecordName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetUniqueIDForHostmigration
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetUniqueIDForHostmigration_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetGaugeRatio
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetGaugeRatio_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.ShouldBeHiddenBySHOW_NavigationNodes
// [0x00020400] ( FUNC_Native )
struct AActor_execShouldBeHiddenBySHOW_NavigationNodes_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.WillOverlap
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execWillOverlap_Parms
{
	struct FVector                                     PosA;                                             		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelA;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     PosB;                                             		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelB;                                             		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Radius;                                           		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Time;                                             		// 0x0038 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x003C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetAvoidanceVector
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetAvoidanceVector_Parms
{
	TArray< class AActor* >                            Obstacles;                                        		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FVector                                     GoalLocation;                                     		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              CollisionRadius;                                  		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              MaxSpeed;                                         		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumSamples;                                       		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              VelocityStepRate;                                 		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              MaxTimeTilOverlap;                                		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x002C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsClient
// [0x00020103] ( FUNC_Final )
struct AActor_execIsClient_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsServer
// [0x00020103] ( FUNC_Final )
struct AActor_execIsServer_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsOwningClient
// [0x00020102] 
struct AActor_execIsOwningClient_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] ( FUNC_Event )
struct AActor_eventReplicationEnded_Parms
{
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostDemoRewind_Parms
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] ( FUNC_Event )
struct AActor_eventAnimTreeUpdated_Parms
{
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execSupportsKismetModification_Parms
{
	class USequenceOp*                                 AskingOp;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Reason;                                           		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyEnd_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyTick_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotify_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayParticleEffect_Parms
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.GetAimAdhesionExtent
// [0x00420102] 
struct AActor_execGetAimAdhesionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Center;                                           		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.GetAimFrictionExtent
// [0x00420102] 
struct AActor_execGetAimFrictionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Center;                                           		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsInPersistentLevel_Parms
{
	unsigned long                                      bIncludeLevelStreamingPersistent : 1;             		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] ( FUNC_Event )
struct AActor_eventOnRigidBodySpringOverextension_Parms
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetPackageGuid_Parms
{
	struct FName                                       PackageName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FGuid                                       ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] ( FUNC_Event )
struct AActor_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] ( FUNC_Event )
struct AActor_eventRootMotionExtracted_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         		// 0x0010 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventRootMotionModeChanged_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AActor_execNativePostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AActor_execSetHUDLocation_Parms
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnRanOver
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnRanOver_Parms
{
	class ASVehicle*                                   Vehicle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	int                                                WheelIndex;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] ( FUNC_Event )
struct AActor_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationChanged_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationFinished_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationStarted_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UInterpGroupInst*                            GroupInst;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.PickedUpBy
// [0x00020000] 
struct AActor_execPickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] ( FUNC_Event )
struct AActor_eventSpawnedByKismet_Parms
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500] ( FUNC_Native )
struct AActor_execGetTargetLocation_Parms
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRequestAlternateLoc : 1;                         		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102] 
struct AActor_execFindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    GoodRotation;                                     		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100] 
struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{
};

// Function Engine.Actor.GetLocationStringFor
// [0x00020102] 
struct AActor_execGetLocationStringFor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] ( FUNC_Event )
struct AActor_eventScriptGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AActor_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000] 
struct AActor_execPawnBaseDied_Parms
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500] ( FUNC_Native )
struct AActor_execIsPlayerOwned_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420902] ( FUNC_Event )
struct AActor_eventGetActorEyesViewPoint_Parms
{
	struct FVector                                     out_Location;                                     		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_Rotation;                                     		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.IsStationary
// [0x00020002] 
struct AActor_execIsStationary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] ( FUNC_Event )
struct AActor_eventGetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102] 
struct AActor_execCanActorPlayFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102] 
struct AActor_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetSkelControlScale_Parms
{
	struct FName                                       SkelControlName;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Scale;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetMorphWeight_Parms
{
	struct FName                                       MorphNodeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventStopActorFaceFXAnim_Parms
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     GroupName;                                        		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     SeqName;                                          		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class USoundCue*                                   SoundCueToPlay;                                   		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventFinishAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetAnimPosition_Parms
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       InAnimSeqName;                                    		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFireNotifies : 1;                                		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bLooping : 1;                                     		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventBeginAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimPlay
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.DoKismetAttachment
// [0x00820102] 
struct AActor_execDoKismetAttachment_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bOldCollideActors : 1;                            		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	// unsigned long                                   bOldBlockActors : 1;                              		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	// struct FVector                                  X;                                                		// 0x0010 (0x000C) [0x0000000000000000]              
	// struct FVector                                  Y;                                                		// 0x001C (0x000C) [0x0000000000000000]              
	// struct FVector                                  Z;                                                		// 0x0028 (0x000C) [0x0000000000000000]              
};

// Function Engine.Actor.OnAttachToActor
// [0x00020102] 
struct AActor_execOnAttachToActor_Parms
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Idx;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Attachment;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x000C (0x0004) [0x0000000000000000]              
	// TArray< class UObject* >                        objVars;                                          		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102] 
struct AActor_execOnToggleHidden_Parms
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AttachIdx;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnChangeCollision
// [0x00020102] 
struct AActor_execOnChangeCollision_Parms
{
	class USeqAct_ChangeCollision*                     Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetPhysics
// [0x00020102] 
struct AActor_execOnSetPhysics_Parms
{
	class USeqAct_SetPhysics*                          Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x00020102] 
struct AActor_execOnSetBlockRigidBody_Parms
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetVelocity
// [0x00820102] 
struct AActor_execOnSetVelocity_Parms
{
	class USeqAct_SetVelocity*                         Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  V;                                                		// 0x0004 (0x000C) [0x0000000000000000]              
	// float                                           Mag;                                              		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnTeleport
// [0x00020102] 
struct AActor_execOnTeleport_Parms
{
	class USeqAct_Teleport*                            Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// TArray< class UObject* >                        objVars;                                          		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             Idx;                                              		// 0x0010 (0x0004) [0x0000000000000000]              
	// class AActor*                                   destActor;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.OnModifyHealth
// [0x00020102] 
struct AActor_execOnModifyHealth_Parms
{
	class USeqAct_ModifyHealth*                        Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class AController*                              InstigatorController;                             		// 0x0004 (0x0004) [0x0000000000000000]              
	// class APawn*                                    InstigatorPawn;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.PrestreamTextures
// [0x00024400] ( FUNC_Native )
struct AActor_execPrestreamTextures_Parms
{
	float                                              Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bEnableStreaming : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                CinematicTextureGroups;                           		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Engine.Actor.ShutDown
// [0x00020902] ( FUNC_Event )
struct AActor_eventShutDown_Parms
{
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execSetNetUpdateTime_Parms
{
	float                                              NewUpdateTime;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.ForceNetRelevant
// [0x00020802] ( FUNC_Event )
struct AActor_eventForceNetRelevant_Parms
{
};

// Function Engine.Actor.OnDestroy
// [0x00020102] 
struct AActor_execOnDestroy_Parms
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AttachIdx;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.ClearLatentAction
// [0x00024103] ( FUNC_Final )
struct AActor_execClearLatentAction_Parms
{
	class UClass*                                      actionClass;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAborted : 1;                                     		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	class USeqAct_Latent*                              exceptionAction;                                  		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// int                                             Idx;                                              		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.FindEventsOfClass
// [0x00424103] ( FUNC_Final )
struct AActor_execFindEventsOfClass_Parms
{
	class UClass*                                      EventClass;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< class USequenceEvent* >                    out_EventList;                                    		// 0x0004 (0x000C) [0x0000000000400190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      bIncludeDisabled : 1;                             		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USequenceEvent*                           Evt;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bFoundEvent : 1;                                  		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function Engine.Actor.ActivateEventClass
// [0x00424103] ( FUNC_Final )
struct AActor_execActivateEventClass_Parms
{
	class UClass*                                      InClass;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      InInstigator;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< class USequenceEvent* >                    EventList;                                        		// 0x0008 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	TArray< int >                                      ActivateIndices;                                  		// 0x0014 (0x000C) [0x0000000000400192]              ( CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      bTest : 1;                                        		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	TArray< class USequenceEvent* >                    ActivatedEvents;                                  		// 0x0024 (0x000C) [0x0000000000400190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0030 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USequenceEvent*                           Evt;                                              		// 0x0034 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.TriggerGlobalEventClass
// [0x00024102] 
struct AActor_execTriggerGlobalEventClass_Parms
{
	class UClass*                                      InEventClass;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      InInstigator;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ActivateIndex;                                    		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// TArray< class USequenceObject* >                EventsToActivate;                                 		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< int >                                   ActivateIndices;                                  		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class USequence*                                GameSeq;                                          		// 0x0028 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bResult : 1;                                      		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
	// int                                             I;                                                		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function Engine.Actor.ReceivedNewEvent
// [0x00020900] ( FUNC_Event )
struct AActor_eventReceivedNewEvent_Parms
{
	class USequenceEvent*                              Evt;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.TriggerEventClass
// [0x00424102] 
struct AActor_execTriggerEventClass_Parms
{
