/*
#############################################################################################
# Special Force 2 (1.0.46397.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: SFGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, crylessdomore
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct SFGame.SFTypes.sVipGradeInfo
// 0x0024
struct FsVipGradeInfo
{
	unsigned char                                      Grade;                                            		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                from_point;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                to_point;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              Discount;                                         		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              AddEXP;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              AddSpGauge;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              AddRoomOtherExpRate;                              		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              AddRoomOtherSpGaugeRate;                          		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              AddLuckyPoint;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SModeStatInfo
// 0x0008
struct FSModeStatInfo
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                Value;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SFacebookUserInfo
// 0x0024
struct FSFacebookUserInfo
{
	struct FQWord                                      FacebookID;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FString                                     FacebookName;                                     		// 0x0008 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                USN;                                              		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FString                                     CodeName;                                         		// 0x0018 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.TwitchTVResolutionInfo
// 0x0014
struct FTwitchTVResolutionInfo
{
	struct FString                                     ResolutionText;                                   		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Width;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                Height;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SClanInfo
// 0x013C
struct FSClanInfo
{
	struct FString                                     CSN;                                              		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanName;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     WebURL;                                           		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Area;                                             		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MemeberCount;                                     		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MasterUSN;                                        		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MasterName;                                       		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Notice;                                           		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Regdate;                                          		// 0x006C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanPoint;                                        		// 0x0078 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     GameCount;                                        		// 0x0084 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     WinCount;                                         		// 0x0090 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     PageCount;                                        		// 0x009C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     AreaText;                                         		// 0x00A8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     RegularCount;                                     		// 0x00B4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MaxClanCount;                                     		// 0x00C0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanRank;                                         		// 0x00CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMark;                                         		// 0x00D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMarkEffect;                                   		// 0x00E4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Mode_No;                                          		// 0x00F0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Map_No;                                           		// 0x00FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           OptionDataValue;                                  		// 0x0108 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nCSN;                                             		// 0x0114 (0x0004) [0x0000000000000000]              
	struct FString                                     GFXClanPoint;                                     		// 0x0118 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nMemeberCount;                                    		// 0x0124 (0x0004) [0x0000000000000000]              
	int                                                nRegularCount;                                    		// 0x0128 (0x0004) [0x0000000000000000]              
	int                                                nGameCount;                                       		// 0x012C (0x0004) [0x0000000000000000]              
	int                                                nWinCount;                                        		// 0x0130 (0x0004) [0x0000000000000000]              
	int                                                nMaxClanCount;                                    		// 0x0134 (0x0004) [0x0000000000000000]              
	int                                                nClanRank;                                        		// 0x0138 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SFiringRangeListInfo
// 0x006C
struct FSFiringRangeListInfo
{
	struct FString                                     Rank;                                             		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     USN;                                              		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CodeName;                                         		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CSN;                                              		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanName;                                         		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMark;                                         		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Score;                                            		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Initial;                                          		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                nUSN;                                             		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                nCSN;                                             		// 0x0064 (0x0004) [0x0000000000000000]              
	int                                                nScore;                                           		// 0x0068 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.S1VS1UserRankInfo
// 0x006C
struct FS1VS1UserRankInfo
{
	struct FString                                     RankingStartDate;                                 		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Ranking;                                          		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Rank;                                             		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     USN;                                              		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CodeName;                                         		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Kill;                                             		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Death;                                            		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Win;                                              		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Lose;                                             		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SClanRecommend
// 0x0078
struct FSClanRecommend
{
	struct FString                                     ClanIndex;                                        		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     USN;                                              		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     CSN;                                              		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanName;                                         		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMaster;                                       		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ClanMark;                                         		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     RecommendUSN;                                     		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     RecommendNick;                                    		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     RecommendDate;                                    		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     Result;                                           		// 0x006C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SClanModeMap
// 0x001C
struct FSClanModeMap
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     Img;                                              		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     LocalName;                                        		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SDetailOption
// 0x0028
struct FSDetailOption
{
	struct FString                                     Tag;                                              		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     LocalName;                                        		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           DropDownName;                                     		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                DefaultSelectedIndex;                             		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SDropDownMenu
// 0x0024
struct USFTypes_FSDropDownMenu
{
	class UGFxClikWidget*                              DropDownMenuWidget;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     DropDownWidgetName;                               		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                SelectedIndex;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FString                                     Tag;                                              		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                DefaultSelectedIndex;                             		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.DistortionData
// 0x0008
struct FDistortionData
{
	float                                              LifeSpan;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Quantity;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SRecvPacketHandler
// 0x0028
struct FSRecvPacketHandler
{
	int                                                ProtocolID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FScriptDelegate >                   OKHandler;                                        		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FScriptDelegate >                   TransactionHandler;                               		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FScriptDelegate >                   AutoHandler;                                      		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.GameCondition
// 0x000C
struct FGameCondition
{
	int                                                Kill;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Death;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                HeadShot;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.UserConditionData
// 0x001C
struct FUserConditionData
{
	int                                                PlayerID;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FGameCondition                              RecentCondition;                                  		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FGameCondition                              BaseCondition;                                    		// 0x0010 (0x000C) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SBombSPData
// 0x002C
struct FSBombSPData
{
	int                                                PlayerID;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                GiveSP;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FQWord                                      CouponSN[ 0x3 ];                                  		// 0x0008 (0x0018) [0x0000000000000000]              
	int                                                RemainNumber[ 0x3 ];                              		// 0x0020 (0x000C) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.sPlayerVIPInfo
// 0x0028
struct FsPlayerVIPInfo
{
	struct FString                                     ItemCode;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                DailyVipPoint;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                TotalVipPoint;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      VipGrade;                                         		// 0x0014 (0x0001) [0x0000000000000000]              
	float                                              Discount;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     ExpriedDate;                                      		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.sPawnTuneInfo
// 0x0010
struct FsPawnTuneInfo
{
	int                                                Level;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              TakeDamageRatio;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              GroundSpeedRatio;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              DodgeSpeed;                                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.sWeaponTuneInfo
// 0x0024
struct FsWeaponTuneInfo
{
	struct FString                                     WeaponClassString;                                		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      WeaponClass;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                Level;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              InstantHitDamage;                                 		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              Thickness;                                        		// 0x0018 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             TracerTemplate;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             ExtraTracerTemplate;                              		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.sWeaponInitInfo
// 0x0058
struct FsWeaponInitInfo
{
	struct FString                                     WeaponClassString;                                		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UClass*                                      WeaponClass;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              InstantHitDamage;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              ReloadTime;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              WeaponRange;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                AmmoInMgzCount;                                   		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                AmmoCount;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              KnockBack;                                        		// 0x0024 (0x0004) [0x0000000000000000]              
	float                                              StoppingPower;                                    		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                PenetrationCount;                                 		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              PenetrationPower;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                bForceAutomatic;                                  		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                bUseLoopReload;                                   		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                Spread;                                           		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                SGPelletCount;                                    		// 0x0040 (0x0004) [0x0000000000000000]              
	float                                              GrazeDamageRate;                                  		// 0x0044 (0x0004) [0x0000000000000000]              
	float                                              GrazeExtend;                                      		// 0x0048 (0x0004) [0x0000000000000000]              
	TArray< int >                                      RoundBurst;                                       		// 0x004C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.sAjdPawnProp
// 0x0034
struct FsAjdPawnProp
{
	unsigned char                                      AIType;                                           		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                Health;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DamageAdj;                                        		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DamageAdjRadi;                                    		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              GroundSpeed;                                      		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SprintingPct;                                     		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              WalkingPct;                                       		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CustomScaleRate;                                  		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              IntenseMulByTime;                                 		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BeginIntenseMulByTime;                            		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxIntenseMulByTime;                              		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DropItemCount;                                    		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                PawnAggroMultiplier;                              		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.SFTakeHitInfo
// 0x0038
struct FSFTakeHitInfo
{
	int                                                Damage;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FVector                                     HitLocation;                                      		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FVector                                     Momentum;                                         		// 0x0010 (0x000C) [0x0000000000000000]              
	class UClass*                                      DamageType;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	struct FName                                       HitBone;                                          		// 0x0020 (0x0008) [0x0000000000000000]              
	int                                                HitBoneIndex;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	int                                                WeaponID;                                         		// 0x002C (0x0004) [0x0000000000000000]              
	class AActor*                                      DamagedBy;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                HitType;                                          		// 0x0034 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.MapRotationInfo
// 0x0008
struct FMapRotationInfo
{
	int                                                ModeID;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MapID;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SliceState
// 0x0014
struct FSliceState
{
	struct FPlane                                      SlicePlane;                                       		// 0x0000 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	int                                                StaticMeshComponentID;                            		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.UsableInGameItemData
// 0x001C
struct FUsableInGameItemData
{
	struct FString                                     ItemType;                                         		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     ItemValue;                                        		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                Amount;                                           		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.SDamageResist
// 0x0008
struct FSDamageResist
{
	class UClass*                                      DamageTypeClass;                                  		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ReduceRate;                                       		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.SQuickJoin
// 0x0010
struct FSQuickJoin
{
	int                                                GameModeID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MapID;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                CustomModeType;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                PickUpWeapon;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SPackageItem
// 0x000C
struct FSPackageItem
{
	int                                                pkg_itemid;                                       		// 0x0000 (0x0004) [0x0000000000008002]              ( CPF_Const | CPF_Localized )
	int                                                sub_itemid;                                       		// 0x0004 (0x0004) [0x0000000000008002]              ( CPF_Const | CPF_Localized )
	int                                                counts;                                           		// 0x0008 (0x0004) [0x0000000000008002]              ( CPF_Const | CPF_Localized )
};

// ScriptStruct SFGame.SFTypes.SRecommendItemType
// 0x0018
struct FSRecommendItemType
{
	struct FString                                     Typename;                                         		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      ItemArray;                                        		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SRecommendItem
// 0x0020
struct FSRecommendItem
{
	int                                                MaxRank;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MaxSP;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	TArray< struct FString >                           KeyTypes;                                         		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           BaseTypes;                                        		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SGuideItem
// 0x0014
struct FSGuideItem
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     ModeItemCode;                                     		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bUnSelected : 1;                                  		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFGame.SFTypes.AIPawnScore
// 0x001C
struct FAIPawnScore
{
	unsigned char                                      PawnType;                                         		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bTeamReward : 1;                                  		// 0x0004 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      RewardBuff;                                       		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	float                                              BasisScore;                                       		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BasisModeExp;                                     		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BasisModeMoney;                                   		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CriticalDistance;                                 		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.DamageRatioByGameMode
// 0x000C
struct FDamageRatioByGameMode
{
	float                                              DamageRatio;                                      		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       DamageTypeName;                                   		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.InGameStoreItem
// 0x0068
struct FInGameStoreItem
{
	int                                                ItemId;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                MaxCount;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                UsableLevel;                                      		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                Price;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                ResellPrice;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              PriceRatio;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              UpgradePriceRate;                                 		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     TabName;                                          		// 0x001C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     TabImage;                                         		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                GroupIndex;                                       		// 0x0034 (0x0004) [0x0000000000000000]              
	unsigned long                                      InstantBuy : 1;                                   		// 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FString                                     strInstantMsg;                                    		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                LogData;                                          		// 0x0048 (0x0004) [0x0000000000000000]              
	struct FString                                     ParticleName;                                     		// 0x004C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     SoundName;                                        		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bDisableInUseItem : 1;                            		// 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFGame.SFTypes.WeaponAmmo
// 0x0014
struct FWeaponAmmo
{
	unsigned char                                      WeaponGroup;                                      		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                AddedAmmo;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                LimitAmmo;                                        		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                AddedMagazine;                                    		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                LimitMagazine;                                    		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct SFGame.SFTypes.SRepairAllDialogInfo
// 0x0050
struct FSRepairAllDialogInfo
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     msg;                                              		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           WeaponNames;                                      		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           WeaponImgs;                                       		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      RepairGauges;                                     		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      NeedSps;                                          		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FQWord >                            ItemSNs;                                          		// 0x0044 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SRepairDialogInfo
// 0x0050
struct FSRepairDialogInfo
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     MySp;                                             		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     NeedSp;                                           		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     msg;                                              		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     WeaponName;                                       		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     WeaponImg;                                        		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                RepairGauge;                                      		// 0x0044 (0x0004) [0x0000000000000000]              
	struct FQWord                                      ItemSN;                                           		// 0x0048 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SResellDialogInfo
// 0x0018
struct FSResellDialogInfo
{
	int                                                X;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                Y;                                                		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                ItemId;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FQWord                                      ItemSN;                                           		// 0x000C (0x0008) [0x0000000000000000]              
	int                                                DialogType;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SSpawnableAlienInfo
// 0x0020
struct FSSpawnableAlienInfo
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FString                                     ClassName;                                        		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      CombatType;                                       		// 0x0010 (0x0001) [0x0000000000000000]              
	TArray< unsigned char >                            AttackTypes;                                      		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.EnemyInfo
// 0x0008
struct FEnemyInfo
{
	unsigned char                                      EnemyType;                                        		// 0x0000 (0x0001) [0x0000000000000000]              
	float                                              EnemySpawnRate;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.sWaveInfo
// 0x0030
struct FsWaveInfo
{
	int                                                WavePointsRemaining;                              		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              MaxAliveRatio;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              EndOfRoundDelay;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      UseSecondarySpawnPoint : 1;                       		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      NextWaveWhenEliminateEnemy : 1;                   		// 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                ExplicitNextWaveIndex;                            		// 0x0010 (0x0004) [0x0000000000000000]              
	TArray< struct FEnemyInfo >                        EnemyInfoList;                                    		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bIgnorePlayerCounterOnThisWave : 1;               		// 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bPauseWhenAllSpawn : 1;                           		// 0x0020 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FString                                     EventExtermination;                               		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.AdditionalModeResult
// 0x000C
struct FAdditionalModeResult
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                Value;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.AddtionalIdleMotion
// 0x0010
struct FAddtionalIdleMotion
{
	float                                              MinDelay;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              MaxDelay;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FName                                       IdleMotionName;                                   		// 0x0008 (0x0008) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SSupportMap
// 0x0014
struct FSSupportMap
{
	int                                                GameModeID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     MapName;                                          		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      VIPMapUnlock : 1;                                 		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFGame.SFTypes.CachedSupportMap
// 0x0010
struct FCachedSupportMap
{
	int                                                GameModeID;                                       		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FSSupportMap >                      Maps;                                             		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SShutDownNoti
// 0x0014
struct FSShutDownNoti
{
	int                                                NotiType;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                RemainTime;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     ShutDownName;                                     		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SShutDownLaw
// 0x0010
struct FSShutDownLaw
{
	struct FString                                     ShutDownName;                                     		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                ShutDownCode;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.SPvEDifficultyUIInfo
// 0x001C
struct FSPvEDifficultyUIInfo
{
	struct FString                                     MapName;                                          		// 0x0000 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	unsigned char                                      LevelCode;                                        		// 0x000C (0x0001) [0x0000000000008002]              ( CPF_Const | CPF_Localized )
	struct FString                                     LevelText;                                        		// 0x0010 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SMapCaption
// 0x0024
struct FSMapCaption
{
	struct FString                                     MapName;                                          		// 0x0000 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     ImageURL;                                         		// 0x000C (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     Text;                                             		// 0x0018 (0x000C) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SEmblemInfo
// 0x0010
struct FSEmblemInfo
{
	int                                                Id;                                               		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0004 (0x0001) [0x0000000000000000]              
	int                                                Condition;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      Available : 1;                                    		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct SFGame.SFTypes.SWeaponProgressionTask
// 0x0044
struct FSWeaponProgressionTask
{
	struct FName                                       SupplyCode;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	int                                                TaskIndex;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                ItemId;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bSPBuyable : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                LimitRank;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                CurProgress;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                MaxProgress;                                      		// 0x001C (0x0004) [0x0000000000000000]              
	struct FString                                     ChallengeName;                                    		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ChallengeImage;                                   		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ChallengeMessage;                                 		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.SAdditionalInfo
// 0x0008
struct FSAdditionalInfo
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                Value;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct SFGame.SFTypes.ChallengeLocalized
// 0x0018
struct FChallengeLocalized
{
	struct FString                                     ChallengeName;                                    		// 0x0000 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     UI_Message;                                       		// 0x000C (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
};

// ScriptStruct SFGame.SFTypes.ChallengeData
// 0x0074
struct FChallengeData
{
	int                                                Group;                                            		// 0x0000 (0x0004) [0x0000000020000000]              ( CPF_Deprecated )
	int                                                TaskIndex;                                        		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       Contents;                                         		// 0x0008 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                from_GoalPoint;                                   		// 0x0010 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                to_GoalPoint;                                     		// 0x0014 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       SupplyCode;                                       		// 0x0018 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                ChallengePoint;                                   		// 0x0020 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     WeaponType;                                       		// 0x0024 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	int                                                GameModeID;                                       		// 0x0030 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                MissionID;                                        		// 0x0034 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                MapID;                                            		// 0x0038 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      AIType;                                           		// 0x003C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      AIGrade;                                          		// 0x003D (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                TotalPlayerCounter;                               		// 0x0040 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       RewardType;                                       		// 0x0044 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     RewardValue;                                      		// 0x004C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FString                                     ImageSet;                                         		// 0x0058 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FString                                     SheetName;                                        		// 0x0064 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	int                                                EmblemID;                                         		// 0x0070 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct SFGame.SFTypes.SFWeaponLogMember
// 0x0048
struct FSFWeaponLogMember
{
	struct FString                                     WeaponImgName;                                    		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     WeaponCI;                                         		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                KillPercent;                                      		// 0x0018 (0x0004) [0x0000000000000000]              
	int                                                AssistPercent;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	int                                                HeadShotPercent;                                  		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                EtcPercent;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
